package Ch09ClassBasic;

public class C01Classinfo {

	public static void main(String[] args) {
		//1. 객체
		//-> 현실 존재(독점적이고 배타적인 공간을 차지한다) 사물
		//-> 실존하는 객체의 처리를 위한 일부정보를 추출하여(추상화) 프로그램의 메모리 공간에
		//	 담아놓은 단위(==인스턴스)
		
		//2. 추상화
		
		//3. 객체지향
		
		//4. 객체의 구조
		//- 속성 : 객체를 표현하는 세부 데이터 단위 (변수로 처리)
		//- 기능 : 객체가 구현할 수 있는 행위 단위 (함수(==메서드)로 처리)
		
		//ex)
		//에어컨
		//- 속성 : 로고문양, 팬, EVA, Display, Moter 개수, 시리얼넘버(SN), Energy Level...
		//- 기능 : Power on/off, 제습, 냉방, 온풍...
		
		//나무
		//- 속성 : 잎, 가지, 줄기, 열매...
		//- 기능 : 광합성, 흡수...
		
		//자동차
		//- 속성 : 계기판, 모델명, 소유자명, 연비...
		//- 기능 : 가속, 감속, 깜빡이...
		
		//컴퓨터
		//- 속성 : 모니터, 본체, 마우스, 키보드, 모델명, Display, CPUSpec, RAMSpec, DISKSpec, 시리얼 넘버...
		//- 기능 : Power on/off,  App start, Memory 제어...
		
		//5. 클래스
		//객체에 필요한 공간을 생성과 기능을 제공하기 위해 미리 선언된 자료형
		
		
		//6. 자바의 메모리 영역
		
		//7. 단순코드로 확인

	}

}
